In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.657949  0.109477
1  X   beta  0.209898 -0.116942
2  Y  alpha -0.446944  0.031518
3  Y   beta -0.865157 -0.011243
4  Z  alpha  0.062885 -0.085914

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

group1

In [4]:
group1.mean()

k1
X   -0.224025
Y   -0.656051
Z    0.062885
Name: dataset1, dtype: float64

In [5]:
cities = np.array(['NY','LA','LA','NY','NY'])

month =np.array(['JAN','FEB','JAN','FEB','JAN'])

In [6]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.209898
    JAN   -0.446944
NY  FEB   -0.865157
    JAN   -0.297532
Name: dataset1, dtype: float64

In [7]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.224025 -0.003732
Y  -0.656051  0.010137
Z   0.062885 -0.085914

In [8]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.657949  0.109477
   beta   0.209898 -0.116942
Y  alpha -0.446944  0.031518
   beta  -0.865157 -0.011243
Z  alpha  0.062885 -0.085914

In [9]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.657949  0.109477
1  X   beta  0.209898 -0.116942
2  Y  alpha -0.446944  0.031518
3  Y   beta -0.865157 -0.011243
4  Z  alpha  0.062885 -0.085914

In [11]:
for name,group in dframe.groupby('k1'):
    print( "This is the %s group"%name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.657949  0.109477
1  X   beta  0.209898 -0.116942


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.446944  0.031518
3  Y   beta -0.865157 -0.011243


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.062885 -0.085914

In [13]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 = %s"%(k1,k2))
    print(group)
    print('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.657949  0.109477


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.209898 -0.116942


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.446944  0.031518


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.865157 -0.011243


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.062885 -0.085914

In [14]:
group_dict = dict(list(dframe.groupby('k1')))

In [16]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.657949  0.109477
1  X   beta  0.209898 -0.116942

In [17]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [18]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.657949  0.109477
 1  0.209898 -0.116942
 2 -0.446944  0.031518
 3 -0.865157 -0.011243
 4  0.062885 -0.085914, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [19]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.109477
   beta  -0.116942
Y  alpha  0.031518
   beta  -0.011243
Z  alpha -0.085914

---

In [20]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns = ['W','X','Y','Z'],
                   index = ['Dog','Cat','Bird','Mouse'])

In [21]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [23]:
animals.loc[1:2,['W','Y']] = np.nan

In [24]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [25]:
behavior_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}

In [26]:
animal_col = animals.groupby(behavior_map,axis=1)

animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [27]:
behav_series = Series(behavior_map)

behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [28]:
animals.groupby(behav_series,axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [29]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [30]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15